[
  {
    "source": "The Hacker News",
    "title": "AI-Assisted Threat Actor Compromises 600+ FortiGate Devices in 55 Countries",
    "link": "https://thehackernews.com/2026/02/ai-assisted-threat-actor-compromises.html",
    "published": "2026-02-21T14:49:00",
    "summary": "A Russian-speaking, financially motivated threat actor has been observed taking advantage of commercial generative artificial intelligence (AI) services to compromise over 600 FortiGate devices located in 55 countries.\nThat's according to new findings from Amazon Threat Intelligence, which said it observed the activity between January 11 and February 18, 2026.\n\"No exploitation of FortiGate.",
    "extra": {}
  },
  {
    "source": "The Hacker News",
    "title": "Anthropic Launches Claude Code Security for AI-Powered Vulnerability Scanning",
    "link": "https://thehackernews.com/2026/02/anthropic-launches-claude-code-security.html",
    "published": "2026-02-21T07:58:00",
    "summary": "Artificial intelligence (AI) company Anthropic has begun to roll out a new security feature for Claude Code that can scan a user's software codebase for vulnerabilities and suggest patches.\nThe capability, called Claude Code Security, is currently available in a limited research preview to Enterprise and Team customers.\n\"It scans codebases for security vulnerabilities and suggests targeted.",
    "extra": {}
  },
  {
    "source": "The Hacker News",
    "title": "CISA Adds Two Actively Exploited Roundcube Flaws to KEV Catalog",
    "link": "https://thehackernews.com/2026/02/cisa-adds-two-actively-exploited.html",
    "published": "2026-02-21T07:21:00",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Friday added two security flaws impacting Roundcube webmail software to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation.\nThe vulnerabilities in question are listed below -\n\nCVE-2025-49113 (CVSS score: 9.9) - A deserialization of untrusted data vulnerability that allows remote code.",
    "extra": {}
  }
]