{"source": "The Hacker News", "title": "Notepad++ Fixes Hijacked Update Mechanism Used to Deliver Targeted Malware", "link": "https://thehackernews.com/2026/02/notepad-fixes-hijacked-update-mechanism.html", "published": "2026-02-18T07:40:00", "summary": "Notepad++ has released a security fix to plug gaps that were exploited by an advanced threat actor from China to hijack the software update mechanism to selectively deliver malware to targets of interest.\nThe version 8.9.2 update incorporates what maintainer Don Ho calls a \"double lock\" design that aims to make the update process \"robust and effectively unexploitable.\" This includes verification.", "extra": {}}
{"source": "The Hacker News", "title": "CISA Flags Four Security Flaws Under Active Exploitation in Latest KEV Update", "link": "https://thehackernews.com/2026/02/cisa-flags-four-security-flaws-under.html", "published": "2026-02-18T06:52:00", "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Tuesday added four security flaws to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation in the wild.\nThe list of vulnerabilities is as follows -\n\nCVE-2026-2441 (CVSS score: 8.8) - A use-after-free vulnerability in Google Chrome that could allow a remote attacker to potentially exploit heap.", "extra": {}}
{"source": "The Hacker News", "title": "Webinar: How Modern SOC Teams Use AI and Context to Investigate Cloud Breaches Faster", "link": "https://thehackernews.com/2026/02/cloud-forensics-webinar-learn-how-ai.html", "published": "2026-02-17T19:08:00", "summary": "Cloud attacks move fast — faster than most incident response teams.\nIn data centers, investigations had time. Teams could collect disk images, review logs, and build timelines over days.", "extra": {}}
{"source": "The Hacker News", "title": "Researchers Show Copilot and Grok Can Be Abused as Malware C2 Proxies", "link": "https://thehackernews.com/2026/02/researchers-show-copilot-and-grok-can.html", "published": "2026-02-17T18:08:00", "summary": "Cybersecurity researchers have disclosed that artificial intelligence (AI) assistants that support web browsing or URL fetching capabilities can be turned into stealthy command-and-control (C2) relays, a technique that could allow attackers to blend into legitimate enterprise communications and evade detection.\nThe attack method, which has been demonstrated against Microsoft Copilot and xAI Grok.", "extra": {}}
{"source": "The Hacker News", "title": "Keenadu Firmware Backdoor Infects Android Tablets via Signed OTA Updates", "link": "https://thehackernews.com/2026/02/keenadu-firmware-backdoor-infects.html", "published": "2026-02-17T16:41:00", "summary": "A new Android backdoor that's embedded deep into the device firmware can silently harvest data and remotely control its behavior, according to new findings from Kaspersky.\nThe Russian cybersecurity vendor said it discovered the backdoor, dubbed Keenadu, in the firmware of devices associated with various brands, including Alldocube, with the compromise occurring during the firmware build phase.", "extra": {}}
{"source": "The Hacker News", "title": "SmartLoader Attack Uses Trojanized Oura MCP Server to Deploy StealC Infostealer", "link": "https://thehackernews.com/2026/02/smartloader-attack-uses-trojanized-oura.html", "published": "2026-02-17T12:42:00", "summary": "Cybersecurity researchers have disclosed details of a new SmartLoader campaign that involves distributing a trojanized version of a Model Context Protocol (MCP) server associated with Oura Health to deliver an information stealer known as StealC.\n\"The threat actors cloned a legitimate Oura MCP Server – a tool that connects AI assistants to Oura Ring health data – and built a deceptive.", "extra": {}}
{"source": "The Hacker News", "title": "My Day Getting My Hands Dirty with an NDR System", "link": "https://thehackernews.com/2026/02/my-day-getting-my-hands-dirty-with-ndr.html", "published": "2026-02-17T11:30:00", "summary": "My objectiveThe role of NDR in SOC workflowsStarting up the NDR systemHow AI complements the human responseWhat else did I try out?What could I see with NDR that I wouldn’t otherwise?Am I ready to be a network security analyst now?\n\n\n\n\n\n\nMy objective\nAs someone relatively inexperienced with network threat hunting, I wanted to get some hands-on experience using a network detection and response (.", "extra": {}}
