{"source": "The Hacker News", "title": "Three Former Google Engineers Indicted Over Trade Secret Transfers to Iran", "link": "https://thehackernews.com/2026/02/three-former-google-engineers-indicted.html", "published": "2026-02-20T05:27:00", "summary": "Two former Google engineers and one of their husbands have been indicted in the U.S. for allegedly committing trade secret theft from the search giant and other tech firms and transferring the information to unauthorized locations, including Iran.\nSamaneh Ghandali, 41, and her husband Mohammadjavad Khosravi (aka Mohammad Khosravi), 40, along with her sister Soroor Ghandali, 32, have been accused.", "extra": {}}
{"source": "The Hacker News", "title": "PromptSpy Android Malware Abuses Gemini AI to Automate Recent-Apps Persistence", "link": "https://thehackernews.com/2026/02/promptspy-android-malware-abuses-google.html", "published": "2026-02-19T17:52:00", "summary": "Cybersecurity researchers have discovered what they say is the first Android malware that abuses Gemini, Google's generative artificial intelligence (AI) chatbot, as part of its execution flow and achieves persistence.\nThe malware has been codenamed PromptSpy by ESET. The malware is equipped to capture lockscreen data, block uninstallation efforts, gather device information, take screenshots,.", "extra": {}}
{"source": "The Hacker News", "title": "INTERPOL Operation Red Card 2.0 Arrests 651 in African Cybercrime Crackdown", "link": "https://thehackernews.com/2026/02/interpol-operation-red-card-20-arrests.html", "published": "2026-02-19T17:50:00", "summary": "An international cybercrime operation against online scams has led to 651 arrests and recovered more than $4.3 million as part of an effort led by law enforcement agencies from 16 African countries.\nThe initiative, codenamed Operation Red Card 2.0, took place between December 8, 2025 and January 30, 2026, according to INTERPOL. It targeted infrastructure and actors behind high-yield investment.", "extra": {}}
{"source": "The Hacker News", "title": "Microsoft Patches CVE-2026-26119 Privilege Escalation in Windows Admin Center", "link": "https://thehackernews.com/2026/02/microsoft-patches-cve-2026-26119.html", "published": "2026-02-19T17:40:00", "summary": "Microsoft has disclosed a now-patched security flaw in Windows Admin Center that could allow an attacker to escalate their privileges.\nWindows Admin Center is a locally deployed, browser-based management tool set that lets users manage their Windows Clients, Servers, and Clusters without the need for connecting to the cloud.\nThe high-severity vulnerability, tracked as CVE-2026-26119, carries a.", "extra": {}}
{"source": "The Hacker News", "title": "ThreatsDay Bulletin: OpenSSL RCE, Foxit 0-Days, Copilot Leak, AI Password Flaws & 20+ Stories", "link": "https://thehackernews.com/2026/02/threatsday-bulletin-openssl-rce-foxit-0.html", "published": "2026-02-19T14:35:00", "summary": "The cyber threat space doesn’t pause, and this week makes that clear. New risks, new tactics, and new security gaps are showing up across platforms, tools, and industries — often all at the same time.\nSome developments are headline-level.", "extra": {}}
{"source": "The Hacker News", "title": "From Exposure to Exploitation: How AI Collapses Your Response Window", "link": "https://thehackernews.com/2026/02/from-exposure-to-exploitation-how-ai.html", "published": "2026-02-19T11:55:00", "summary": "We’ve all seen this before: a developer deploys a new cloud workload and grants overly broad permissions just to keep the sprint moving. An engineer generates a \"temporary\" API key for testing and forgets to revoke it.", "extra": {}}
{"source": "The Hacker News", "title": "Fake IPTV Apps Spread Massiv Android Malware Targeting Mobile Banking Users", "link": "https://thehackernews.com/2026/02/fake-iptv-apps-spread-massiv-android.html", "published": "2026-02-19T10:24:00", "summary": "Cybersecurity researchers have disclosed details of a new Android trojan called Massiv that's designed to facilitate device takeover (DTO) attacks for financial theft.\nThe malware, according to ThreatFabric, masquerades as seemingly harmless IPTV apps to deceive victims, indicating that the activity is primarily singling out users looking for the online TV applications.\n\"This new threat, while.", "extra": {}}
{"source": "The Hacker News", "title": "CRESCENTHARVEST Campaign Targets Iran Protest Supporters With RAT Malware", "link": "https://thehackernews.com/2026/02/crescentharvest-campaign-targets-iran.html", "published": "2026-02-19T08:13:00", "summary": "Cybersecurity researchers have disclosed details of a new campaign dubbed CRESCENTHARVEST, likely targeting supporters of Iran's ongoing protests to conduct information theft and long-term espionage.\nThe Acronis Threat Research Unit (TRU) said it observed the activity after January 9, with the attacks designed to deliver a malicious payload that serves as a remote access trojan (RAT) and.", "extra": {}}
